I see your argument, it's weird to try to connect to a nonexistent cluster on localhost. But it's what `kubectl` does.

It's used, so that given a configuration like this:

```hcl
provider "kind" {}

resource "kind" "example" {
  name = "test"
}

provider "kustomization" {
  kubeconfig_raw = kind.example.kubeconfig
}

data "kustomization" "example" {
  path = "base"
}

resource "kustomization_resource" "example" {
  for_each = data.kustomization.example.ids

  manifest = data.kustomization.example.manifests[each.value]
}

```

The current implementation will plan to first create a cluster, then use the returned `kubeconfig` to provision the k8s resources.

```
$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.kustomization.example: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kind.example will be created
  + resource "kind" "example" {
      + client_certificate     = (known after apply)
      + client_key             = (known after apply)
      + cluster_ca_certificate = (known after apply)
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + kubeconfig             = (known after apply)
      + kubeconfig_path        = (known after apply)
      + name                   = "test"
      + node_image             = (known after apply)
    }

  # kustomization_resource.example["apps_v1_Deployment|~X|test"] will be created
  + resource "kustomization_resource" "example" {
      + id       = (known after apply)
      + manifest = jsonencode(
            {
              + apiVersion = "apps/v1"
              + kind       = "Deployment"
              + metadata   = {
                  + creationTimestamp = null
                  + labels            = {
                      + app = "test"
                    }
                  + name              = "test"
                }
              + spec       = {
                  + replicas = 1
                  + selector = {
                      + matchLabels = {
                          + app = "test"
                        }
                    }
                  + strategy = {}
                  + template = {
                      + metadata = {
                          + creationTimestamp = null
                          + labels            = {
                              + app = "test"
                            }
                        }
                      + spec     = {
                          + containers = [
                              + {
                                  + image     = "nginx"
                                  + name      = "nginx"
                                  + resources = {}
                                },
                            ]
                        }
                    }
                }
              + status     = {}
            }
        )
    }

  # kustomization_resource.example["networking.k8s.io_v1beta1_Ingress|~X|test"] will be created
  + resource "kustomization_resource" "example" {
      + id       = (known after apply)
      + manifest = jsonencode(
            {
              + apiVersion = "networking.k8s.io/v1beta1"
              + kind       = "Ingress"
              + metadata   = {
                  + annotations = {
                      + nginx.ingress.kubernetes.io/rewrite-target = "/"
                    }
                  + name        = "test"
                }
              + spec       = {
                  + rules = [
                      + {
                          + http = {
                              + paths = [
                                  + {
                                      + backend = {
                                          + serviceName = "test"
                                          + servicePort = 80
                                        }
                                      + path    = "/testpath"
                                    },
                                ]
                            }
                        },
                    ]
                }
            }
        )
    }

  # kustomization_resource.example["~G_v1_Service|~X|test"] will be created
  + resource "kustomization_resource" "example" {
      + id       = (known after apply)
      + manifest = jsonencode(
            {
              + apiVersion = "v1"
              + kind       = "Service"
              + metadata   = {
                  + creationTimestamp = null
                  + labels            = {
                      + app = "test"
                    }
                  + name              = "test"
                }
              + spec       = {
                  + ports    = [
                      + {
                          + name       = "http"
                          + port       = 80
                          + protocol   = "TCP"
                          + targetPort = 80
                        },
                    ]
                  + selector = {
                      + app = "test"
                    }
                  + type     = "ClusterIP"
                }
              + status     = {
                  + loadBalancer = {}
                }
            }
        )
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

Your proposed implementation will error out on `terraform plan`:

```
$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


Error: invalid configuration: no configuration has been provided, try setting KUBERNETES_MASTER environment variable

  on main.tf line 7, in provider "kustomization":
   7: provider "kustomization" {
```

I don't know if the fallback to this default config is the best option. But it is what the `kubectl` source code does and it provides the desired result. I'm open for a different implementation if it does not change this behavior.